package homework_lesson12_13;
/*Коллекции*/
import java.util.*;
public class Collections /*implements Collection<E> - можно чекнуть методы*/{
	public static void main(String[] args) {
		/*
		 * Классы коллекций располагаются в пакете java.util, поэтому перед применением
		 * коллекций следует подключить данный пакет. В основе всех коллекций лежит
		 * применение того или иного итнтерфейса, который определяет базовый функционал.
		 * Популярные коллекции: ArrayList LinkedList ArrayDeque Hashset TreeSet
		 * LinkerHashSet PriorityOueue HashMap TreeMap
		 * 
		 * Интерейс Collection является базыовым для всех коллекций (кроме TreeMap),
		 * определяя основной функционал. Данный интерфейс явялется обощенным и
		 * расширяет интерфейс iterable, поэтому все объекты коллекций можно перебирать
		 * по типу for-each
		 *  			
		 */
		
		/*Позаписывать отличия между коллекциями, т.е. какая коллекция для каких целей примняется
		 * Это очень важное занание, так как выбор оптимальной коллекции - эта 50% к скорости решения задачи, т.к. каждая коллекция реа-
		 * лизует свои алгоритмы. А посмотреть методы труда не составляет.*/
	}
}
