package homework_lesson4;
//В этом пэкэджэ должны быть задания 1-5 по многомерным массивам
public class Class {
public static void main(String[] args) {
	
/*N-dimensional array 
 * int [][] arr = new int [][] --- [] - number of arrays. Ex: 
 * int [][] arr4 = {{1,2},{2,4},{5,7}}
 * 
 * Двумерный массив — это массив одномерных массивов (строк), последовательно расположенных в памяти
 * [][] - первая скобка кол-во строк начиная с 0, а втроая - кол-во столбцов, начиная с 0;*/

	
	
	
	
	
	
}
}
